Repository: Cardlink-SA/cardlink-payment-gateway-cscart
Catalog: var/langs/*/addons/cardlink.po
Languages: el

# Addons::name::cardlink
source: Cardlink eCommerce Checkout Payment Gateway
el: Πύλη πληρωμών Cardlink

# Addons::description::cardlink
source: Cardlink eCommerce Checkout Payment Gateway allows you to accept payment through various channels such as Visa, Mastercard, Maestro, American Express, Diners, Discover cards on your CS-Cart powered site
el: Η πύλη πληρωμών Cardlink eCommerce Checkout Payment Gateway σας επιτρέπει να λαμβάνεται πληρωμές στο CS-Cart e-shop σας μέσω διαφορετικών σχημάτων, όπως Visa, Mastercard, Maestro, American Express, Diners και Discover

# Languages::cardlink.select_your_card
source: Select your card
el: Επιλέξτε μια απο τις αποθηκευμένες κάρτες σας

# Languages::cardlink.remove_card
source: Remove card
el: Διαγραγή κάρτας

# Languages::cardlink.add_credit_card
source: Add your credit card
el: Προσθήκη κάρτας

# Languages::cardlink.store_my_card
source: Store my card
el: Αποθήκευσε την κάρτα μου

# Languages::cardlink.select_installments
source: Select Installments
el: Επιλέξτε αριθμό δόσεων

# Languages::cardlink.no_installments
source: No Installments
el: Χωρίς Δόσεις

# Languages::cardlink.installments
source: Installments
el: Δόσεις

# Languages::cardlink.custom_css
source: Custom CSS
el: Αρχείο CSS

# Languages::cardlink.custom_css_tip
source: Url of custom CSS stylesheet, to be used to display payment page styles.
el: URL του CSS stylesheet που θα χρησιμοποιηθεί για την εμφάνιση των σελίδων πληρωμής.

# Languages::cardlink.pre_authorize
source: Pre Authorize
el: Προ-έγκριση

# Languages::cardlink.pre_authorize_tip
source: Default payment method is Purchase, enable for Pre-Authorized payments. You will then need to accept them from Cardlink eCommerce Tool.
el: Η προεπιλεγμένη μέθοδος πληρωμής είναι η Αγορά. Ενεργοποιήστε τις πληρωμές με Προέγκριση. Στη συνέχεια θα πρέπει να τις αποδεχτείτε από το Cardlink Payment Gateway.

# Languages::cardlink.store_cards
source: Store card details
el: Αποθήκευση των στοιχείων της κάρτας

# Languages::cardlink.store_cards_tip
source: If checked the user will have the ability to store credit card details for future purchases. You must contact Cardlink first.<br /> Disabled when iframe mode is ON.
el: Εάν επιλεγεί, ο χρήστης θα έχει τη δυνατότητα αποθήκευσης στοιχείων πιστωτικής κάρτας για μελλοντικές αγορές. Πρέπει πρώτα να επικοινωνήσετε με την Cardlink.<br /> Ανενεργό όταν η λειτουργία πληρωμής μέσω iframe είναι ενεργή.

# Languages::cardlink.enable_iframe
source: Enable payment iframe
el: Ενεργοποίηση πληρωμής μέσω iframe

# Languages::cardlink.enable_iframe_tip
source: Customers will stay in website to complete payments without redirecting to Cardlink's eCommerce payment page.<br />You must have a valid SSL certificate installed on your domain.<br />Not recommended bacause some functionality will be unavailable. For example, the customer won’t be able to subscribe for newsletters at checkout.
el: Οι πελάτες θα πραγματοποιήσουν την πληρωμή χωρίς να φύγουν από την σελίδα σας.<br />Θα πρέπει να έχετε ένα έγκυρο SSL certificate εγκατεστημένο στο domain σας. <br />Δεν συνίσταται γιατί μερικές λειτουργίες δεν θα είναι διαθέσιμες. Για παράδειγμα, ο πελάτης δεν θα μπορεί να κάνει εγγραφή στα newsletters κατά την ολοκλήρωση της παραγγελίας.

# Languages::cardlink.language
source: Language
el: Γλώσσα

# Languages::cardlink.english
source: English
el: Αγγλικά

# Languages::cardlink.greek
source: Greek
el: Ελληνικά

# Languages::cardlink.test_live_mode
source: Test/Live mode
el: Test/Live συνθήκες

# Languages::cardlink.test
source: Test mode
el: Test περιβάλλον

# Languages::cardlink.live
source: Live mode
el: Live περιβάλλον

# Languages::cardlink.acquirer
source: Acquirer
el: Επιλέξτε οργανισμό αποδοχής πληρωμών

# Languages::cardlink.min_amount
source: Min Amount
el: Ελάχιστο ποσό

# Languages::cardlink.number_of_installments
source: Number of installments
el: Αριθμός Δόσεων

# Languages::cardlink.unexpected_error
source: Unexpected error received
el: Μη αναμενόμενο σφάλμα

# Languages::cardlink.preauth_expired
source: Preauthorized Transaction has expired
el: Η προ-έγκριση έχει λήξει

# Languages::cardlink.preauth_canceled
source: Merchant cancelled the pre-auth transaction
el: Ο έμπορος ακύρωσε την προ-έγκριση

# Languages::cardlink.unknown_error
source: Unknown error received
el: Άγνωστο σφάλμα!

# Languages::cardlink.digest_wrong
source: Digest was wrong! Possible fraud
el: Η συμβολοσειρά της cardlink δεν συμφωνεί με την παραγώμενη! Πιθανή απάτη
